Revit 2027 API
RevitLinkGraphicsSettings.GetDiscipline Method
 The linked document discipline of RevitLinkGraphicsSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDiscipline GetDiscipline()
Public Function GetDiscipline As ViewDiscipline
public:
ViewDiscipline GetDiscipline()
member GetDiscipline : unit -> ViewDiscipline
Return Value
ViewDiscipline
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace